In [1]:
import pandas as pd
df = pd.read_csv('./usuarios.csv')
df

   id          nombre                       email fecha_registro
0   1      Juan Perez      juan.perez@example.com     2023-01-15
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30

# Es

Agrupar los datos basado en una columna para calcular metricas de interes

In [2]:
group = df.groupby('nombre')['id'].sum()
group

nombre
Carlos Sanchez    3
Juan Perez        1
Maria Gomez       2
Name: id, dtype: int64

In [3]:
group['Carlos Sanchez']

3

In [4]:
group.reset_index()

           nombre  id
0  Carlos Sanchez   3
1      Juan Perez   1
2     Maria Gomez   2

# Varias funciones

In [5]:
df.groupby('nombre')['id'].agg(['min', 'max'])

                min  max
nombre
Carlos Sanchez    3    3
Juan Perez        1    1
Maria Gomez       2    2

In [9]:
df.groupby(['nombre','id']).agg({'fecha_registro':['min', 'max'], 'id':'sum'})

                  fecha_registro              id
                             min         max sum
nombre         id
Carlos Sanchez 3      2023-03-30  2023-03-30   3
Juan Perez     1      2023-01-15  2023-01-15   1
Maria Gomez    2      2023-02-20  2023-02-20   2